{aggregateLikes
: 
11
analyzedInstructions
: 
[{…}]
cheap
: 
false
cookingMinutes
: 
-1
creditsText
: 
"Foodista.com – The Cooking Encyclopedia Everyone Can Edit"
cuisines
: 
[]
dairyFree
: 
false
diets
: 
(2) ['gluten free', 'lacto ovo vegetarian']
dishTypes
: 
['dessert']
extendedIngredients
: 
(7) [{…}, {…}, {…}, {…}, {…}, {…}, {…}]
gaps
: 
"no"
glutenFree
: 
true
healthScore
: 
0
id
: 
637008
image
: 
"https://img.spoonacular.com/recipes/637008-556x370.jpg"
imageType
: 
"jpg"
instructions
: 
"<ol><li>Heat sugar and  cup water for 5 minutes in a big skillet on medium high heat until the sugar melts and boils, stirring occasionally.</li><li>Boil for about 5 minutes until the mixture becomes dark brown in colour; remove from heat.</li><li>Gradually stir in remaining  cup water. Cool to room temperature and set aside.</li><li>Beat eggs for 3 minutes in a medium bowl until thick and light yellow; gradually beat in powdered sugar.</li><li>Stir in cream, salt and vanilla.</li><li>Add caramel mixture, gently stir until smooth.</li><li>Cover and chill for at least 4 hours or overnight.</li><li>Pour the mixture into an ice cream machine and churn until frozen. Transfer to plastic container and place in the freezer for an hour before serving.</li><li>Serving: take it out for 5-10 minutes before serving, or longer, so it comes to the right scooping temperature.</li><li>Easy suggestion: ice cream is best served in chilled glass or porcelain bowls. Scoop it with a hot, but dry, ice-cream spoon (soak it in boiling water, then wipe dry).</li></ol>"
license
: 
"CC BY 3.0"
lowFodmap
: 
false
occasions
: 
['summer']
originalId
: 
null
preparationMinutes
: 
-1
pricePerServing
: 
72.06
readyInMinutes
: 
45
servings
: 
6
sourceName
: 
"Foodista"
sourceUrl
: 
"https://www.foodista.com/recipe/3PMCPVCX/caramel-ice-cream"
spoonacularScore
: 
6.83910608291626
spoonacularSourceUrl
: 
"https://spoonacular.com/caramel-ice-cream-637008"
summary
: 
"You can never have too many dessert recipes, so give Caramel ice cream a try. One portion of this dish contains roughly <b>6g of protein</b>, <b>32g of fat</b>, and a total of <b>481 calories</b>. This recipe serves 6 and costs 72 cents per serving. It can be enjoyed any time, but it is especially good for <b>Summer</b>. This recipe from Foodista requires eggs, heavy cream, powdered sugar, and vanillan extract. It is a good option if you're following a <b>gluten free and lacto ovo vegetarian</b> diet. 11 person found this recipe to be yummy and satisfying. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 17%</b>, which is not so excellent. Try <a href=\"https://spoonacular.com/recipes/no-ice-cream-maker-salted-caramel-bourbon-nutter-butter-and-chocolate-chunk-ice-cream-520118\">No-Ice-Cream-Maker Salted Caramel, Bourbon, Nutter Butter and Chocolate Chunk Ice Cream</a>, <a href=\"https://spoonacular.com/recipes/caramel-ice-cream-sundae-with-salty-peanut-caramel-sauce-35795\">Caramel Ice Cream Sundae With Salty Peanut Caramel Sauce</a>, and <a href=\"https://spoonacular.com/recipes/skinny-caramel-macchiato-ice-cream-with-homemade-caramel-drizzle-608749\">{Skinny} Caramel Macchiato Ice Cream with Homemade Caramel Drizzle</a> for similar recipes."
sustainable
: 
false
title
: 
"Caramel ice cream"
vegan
: 
false
vegetarian
: 
true
veryHealthy
: 
false
veryPopular
: 
false
weightWatcherSmartPoints
: 
24}